#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗапасыУстановитьСпособДоставки(Команда)
	ЗапасыУстановитьСпособДоставкиНаСервере();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗапасыУстановитьСпособДоставкиНаСервере()
	//TODO: Вставить содержимое обработчика
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 3
		|	Номенклатура.ВерсияДанных КАК ВерсияДанных,
		|	Номенклатура.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
		|	Номенклатура.Код КАК Код,
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.ПометкаУдаления КАК ПометкаУдаления,
		|	Номенклатура.Предопределенный КАК Предопределенный,
		|	Номенклатура.Представление КАК Представление,
		|	Номенклатура.Родитель КАК Родитель,
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
		|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	Номенклатура.ВидАттракциона КАК ВидАттракциона,
		|	Номенклатура.КоличествоПосещений КАК КоличествоПосещений
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Счетчик = 0;
	
	Пока Выборка.Следующий() Цикл
		
		НоваяДекорация = Элементы.Добавить("ДекорацияПриветствие_" + Строка(Счетчик),
			Тип("ДекорацияФормы"));
		
		НоваяДекорация.Заголовок = "Это надпись, созданная программно!";
		НоваяДекорация.Вид = ВидДекорацииФормы.Надпись;
		
		НоваяДекорация.Верх = 10 + (Счетчик * 25);
		НоваяДекорация.Лево = 10;
		
		Счетчик = Счетчик + 1;
	КонецЦикла;

КонецПроцедуры
#КонецОбласти


